namespace Ebony_XML_Override_조형_신무장
{
	class Main
	{
		Main()
		{
			if (!pk::NDEBUG)
				return;
			xml();
		}
		void xml()
		{
			// 무장컷인
			// <조형 투구="" 얼굴="" 상체="" 망토="" 팔="" 다리="" 화살통=""/>
			// <조형텍스처 투구="" 얼굴="" 상체="" 망토="" 팔="" 다리="" 화살통=""/>
			pk::load_xml("""
			<pk utf8="true" trace="true">
			<!--이정-->			
			<무장 번호="938">
				<조형 투구="26" 얼굴="25" 상체="" 망토="" 팔="" 다리="" 화살통=""/>
				<조형텍스처 투구="Ebony_조형\이정\26_투구_이정.png" 얼굴="Ebony_조형\이정\25_얼굴_이정.png" 상체="" 망토="" 팔="" 다리="" 화살통=""/>
			</무장>
			<!--이세민-->			
			<무장 번호="937">
				<조형 투구="27" 얼굴="71" 상체="106" 망토="12" 팔="106" 다리="" 화살통=""/>
				<조형텍스처 투구="Ebony_조형\이세민\27_투구_이세민.png" 얼굴="Ebony_조형\이세민\71_얼굴_이세민.png" 상체="Ebony_조형\이세민\106_상체_이세민.png" 망토="Ebony_조형\이세민\12_망토_이세민.png" 팔="" 다리="" 화살통=""/>
			</무장>
			<!--칭기즈칸-->
			<무장 번호="945">
				<조형 투구="71" 얼굴="71" 상체="" 망토="12" 팔="" 다리="" 화살통=""/>
				<조형텍스처 투구="Ebony_조형\테무친\71_투구_테무친.png" 얼굴="Ebony_조형\테무친\71_얼굴_테무친.png" 상체="" 망토="Ebony_조형\테무친\12_망토_테무친.png" 팔="" 다리="" 화살통=""/>
			</무장>
			<!--조씨정-->
			<무장 번호="921">
			<조형텍스처 투구="Ebony_조형\조씨정\34_투구_조씨정.png" 얼굴="Ebony_조형\조씨정\34_얼굴_조씨정.png" 팔="Ebony_조형\조씨정\34_팔.png" /></무장>
			<!--황주호--><무장 번호="961">	
			<조형텍스처 왼손무기="Ebony_조형\[무기]\창_Red01.png" 오른손무기="Ebony_조형\[무기]\창_Red01.png" 말="Ebony_조형\[말]\말_Base00.png"/></무장>
			<!--황선율-->
			<무장 번호="962">	
			<조형텍스처 왼손무기="Ebony_조형\[무기]\창_Red00.png" 오른손무기="Ebony_조형\[무기]\창_Red00.png" 말="Ebony_조형\[말]\말_Base01.png"/></무장>
			</pk>							
			""");			
		}
	}

	Main main;
}