namespace Ebony_XML_Override_지형텍스쳐
{
	class Main
	{
		Main()
		{
			if (!pk::NDEBUG)
				return;
			xml();
		}
		void xml()
		{
			// 지형텍스처팩
			pk::load_xml("""
			<pk utf8="true" trace="true">
				//<!-- 봄 -->
				<_4801.0 값="Ebony_지형텍스처\봄\4801-1.png"/>
				<_4801.1 값="Ebony_지형텍스처\봄\4801-2.png"/>
				<_4801.2 값="Ebony_지형텍스처\봄\4801-3.png"/>
				<_4801.3 값="Ebony_지형텍스처\봄\4801-4.png"/>
				<_4801.4 값="Ebony_지형텍스처\봄\4801-5.png"/>
				<_4801.5 값="Ebony_지형텍스처\봄\4801-6.png"/>
				<_4801.6 값="Ebony_지형텍스처\봄\4801-7.png"/>
				<_4801.7 값="Ebony_지형텍스처\봄\4801-8.png"/>
				<_4801.8 값="Ebony_지형텍스처\봄\4801-9.png"/>
				<_4801.9 값="Ebony_지형텍스처\봄\4801-10.png"/>
				<_4801.10 값="Ebony_지형텍스처\봄\4801-11.png"/>
				<_4801.11 값="Ebony_지형텍스처\봄\4801-12.png"/>
				<_4801.12 값="Ebony_지형텍스처\봄\4801-13.png"/>
				<_4801.13 값="Ebony_지형텍스처\봄\4801-14.png"/>
				<_4801.14 값="Ebony_지형텍스처\봄\4801-15.png"/>
				<_4801.15 값="Ebony_지형텍스처\봄\4801-16.png"/>
				<_4801.16 값="Ebony_지형텍스처\봄\4801-17.png"/>
				<_4801.17 값="Ebony_지형텍스처\봄\4801-18.png"/>
				<_4801.18 값="Ebony_지형텍스처\봄\4801-19.png"/>
				<_4801.19 값="Ebony_지형텍스처\봄\4801-20.png"/>
				<_4801.20 값="Ebony_지형텍스처\봄\4801-21.png"/>
				<_4801.21 값="Ebony_지형텍스처\봄\4801-22.png"/>
				<_4801.22 값="Ebony_지형텍스처\봄\4801-23.png"/>
				<_4801.23 값="Ebony_지형텍스처\봄\4801-24.png"/>
				<_4801.24 값="Ebony_지형텍스처\봄\4801-25.png"/>
				<_4801.25 값="Ebony_지형텍스처\봄\4801-26.png"/>
				<_4801.26 값="Ebony_지형텍스처\봄\4801-27.png"/>
				<_4801.27 값="Ebony_지형텍스처\봄\4801-28.png"/>
				<_4801.28 값="Ebony_지형텍스처\봄\4801-29.png"/>
				<_4801.29 값="Ebony_지형텍스처\봄\4801-30.png"/>
				<_4801.30 값="Ebony_지형텍스처\봄\4801-31.png"/>
				<_4801.31 값="Ebony_지형텍스처\봄\4801-32.png"/>
				<_4801.32 값="Ebony_지형텍스처\봄\4801-33.png"/>
				<_4801.33 값="Ebony_지형텍스처\봄\4801-34.png"/>
				<_4801.34 값="Ebony_지형텍스처\봄\4801-35.png"/>
				<_4801.35 값=""/>
				//<!-- 여름 -->
				<_4802.0 값="Ebony_지형텍스처\여름\4802-1.png"/>
				<_4802.1 값="Ebony_지형텍스처\여름\4802-2.png"/>
				<_4802.2 값="Ebony_지형텍스처\여름\4802-3.png"/>
				<_4802.3 값="Ebony_지형텍스처\여름\4802-4.png"/>
				<_4802.4 값="Ebony_지형텍스처\여름\4802-5.png"/>
				<_4802.5 값="Ebony_지형텍스처\여름\4802-6.png"/>
				<_4802.6 값="Ebony_지형텍스처\여름\4802-7.png"/>
				<_4802.7 값="Ebony_지형텍스처\여름\4802-8.png"/>
				<_4802.8 값="Ebony_지형텍스처\여름\4802-9.png"/>
				<_4802.9 값="Ebony_지형텍스처\여름\4802-10.png"/>
				<_4802.10 값="Ebony_지형텍스처\여름\4802-11.png"/>
				<_4802.11 값="Ebony_지형텍스처\여름\4802-12.png"/>
				<_4802.12 값="Ebony_지형텍스처\여름\4802-13.png"/>
				<_4802.13 값="Ebony_지형텍스처\여름\4802-14.png"/>
				<_4802.14 값="Ebony_지형텍스처\여름\4802-15.png"/>
				<_4802.15 값="Ebony_지형텍스처\여름\4802-16.png"/>
				<_4802.16 값="Ebony_지형텍스처\여름\4802-17.png"/>
				<_4802.17 값="Ebony_지형텍스처\여름\4802-18.png"/>
				<_4802.18 값="Ebony_지형텍스처\여름\4802-19.png"/>
				<_4802.19 값="Ebony_지형텍스처\여름\4802-20.png"/>
				<_4802.20 값="Ebony_지형텍스처\여름\4802-21.png"/>
				<_4802.21 값="Ebony_지형텍스처\여름\4802-22.png"/>
				<_4802.22 값="Ebony_지형텍스처\여름\4802-23.png"/>
				<_4802.23 값="Ebony_지형텍스처\여름\4802-24.png"/>
				<_4802.24 값="Ebony_지형텍스처\여름\4802-25.png"/>
				<_4802.25 값="Ebony_지형텍스처\여름\4802-26.png"/>
				<_4802.26 값="Ebony_지형텍스처\여름\4802-27.png"/>
				<_4802.27 값="Ebony_지형텍스처\여름\4802-28.png"/>
				<_4802.28 값="Ebony_지형텍스처\여름\4802-29.png"/>
				<_4802.29 값="Ebony_지형텍스처\여름\4802-30.png"/>
				<_4802.30 값="Ebony_지형텍스처\여름\4802-31.png"/>
				<_4802.31 값="Ebony_지형텍스처\여름\4802-32.png"/>
				<_4802.32 값="Ebony_지형텍스처\여름\4802-33.png"/>
				<_4802.33 값="Ebony_지형텍스처\여름\4802-34.png"/>
				<_4802.34 값="Ebony_지형텍스처\여름\4802-35.png"/>
				<_4802.35 값=""/>
				//<!-- 가을 -->
				<_4800.0 값="Ebony_지형텍스처\가을\4800-1.png"/> //<!--물밑-->
				<_4800.1 값="Ebony_지형텍스처\가을\4800-2.png"/>
				<_4800.2 값="Ebony_지형텍스처\가을\4800-3.png"/>
				<_4800.3 값="Ebony_지형텍스처\가을\4800-4.png"/>
				<_4800.4 값="Ebony_지형텍스처\가을\4800-5.png"/>
				<_4800.5 값="Ebony_지형텍스처\가을\4800-6.png"/>
				<_4800.6 값="Ebony_지형텍스처\가을\4800-7.png"/>
				<_4800.7 값="Ebony_지형텍스처\가을\4800-8.png"/>
				<_4800.8 값="Ebony_지형텍스처\가을\4800-9.png"/>
				<_4800.9 값="Ebony_지형텍스처\가을\4800-10.png"/>
				<_4800.10 값="Ebony_지형텍스처\가을\4800-11.png"/>
				<_4800.11 값="Ebony_지형텍스처\가을\4800-12.png"/> //<!--꼭대기-->
				<_4800.12 값="Ebony_지형텍스처\가을\4800-13.png"/>
				<_4800.13 값="Ebony_지형텍스처\가을\4800-14.png"/> //<!--땅(샛길)(강북)-->
				<_4800.14 값="Ebony_지형텍스처\가을\4800-15.png"/>
				<_4800.15 값="Ebony_지형텍스처\가을\4800-16.png"/> //<!--초원 -->
				<_4800.16 값="Ebony_지형텍스처\가을\4800-17.png"/>
				<_4800.17 값="Ebony_지형텍스처\가을\4800-18.png"/> 
				<_4800.18 값="Ebony_지형텍스처\가을\4800-19.png"/>
				<_4800.19 값="Ebony_지형텍스처\가을\4800-20.png"/>
				<_4800.20 값="Ebony_지형텍스처\가을\4800-21.png"/>
				<_4800.21 값="Ebony_지형텍스처\가을\4800-22.png"/>
				<_4800.22 값="Ebony_지형텍스처\가을\4800-23.png"/>
				<_4800.23 값="Ebony_지형텍스처\가을\4800-24.png"/>
				<_4800.24 값="Ebony_지형텍스처\가을\4800-25.png"/>
				<_4800.25 값="Ebony_지형텍스처\가을\4800-26.png"/>
				<_4800.26 값="Ebony_지형텍스처\가을\4800-27.png"/> //<!--황야-->
				<_4800.27 값="Ebony_지형텍스처\가을\4800-28.png"/> //<!--땅(샛길)(강남)-->
				<_4800.28 값="Ebony_지형텍스처\가을\4800-29.png"/>
				<_4800.29 값="Ebony_지형텍스처\가을\4800-30.png"/>
				<_4800.30 값="Ebony_지형텍스처\가을\4800-31.png"/> //<!--숲-->
				<_4800.31 값="Ebony_지형텍스처\가을\4800-32.png"/> //<!--길경계-->
				<_4800.32 값="Ebony_지형텍스처\가을\4800-33.png"/> //<!--길경계-->
				<_4800.33 값="Ebony_지형텍스처\가을\4800-34.png"/> //<!--대로 (강북)-->
				<_4800.34 값="Ebony_지형텍스처\가을\4800-35.png"/> //<!--대로 (강남)-->
				<_4800.35 값=""/>
				//<!-- 겨울 -->
				<_4803.0 값="Ebony_지형텍스처\겨울\4803-1.png"/>
				<_4803.1 값="Ebony_지형텍스처\겨울\4803-2.png"/>
				<_4803.2 값="Ebony_지형텍스처\겨울\4803-3.png"/>
				<_4803.3 값="Ebony_지형텍스처\겨울\4803-4.png"/>
				<_4803.4 값="Ebony_지형텍스처\겨울\4803-5.png"/>
				<_4803.5 값="Ebony_지형텍스처\겨울\4803-6.png"/>
				<_4803.6 값="Ebony_지형텍스처\겨울\4803-7.png"/>
				<_4803.7 값="Ebony_지형텍스처\겨울\4803-8.png"/>
				<_4803.8 값="Ebony_지형텍스처\겨울\4803-9.png"/>
				<_4803.9 값="Ebony_지형텍스처\겨울\4803-10.png"/>
				<_4803.10 값="Ebony_지형텍스처\겨울\4803-11.png"/>
				<_4803.11 값="Ebony_지형텍스처\겨울\4803-12.png"/>
				<_4803.12 값="Ebony_지형텍스처\겨울\4803-13.png"/>
				<_4803.13 값="Ebony_지형텍스처\겨울\4803-14.png"/>
				<_4803.14 값="Ebony_지형텍스처\겨울\4803-15.png"/>
				<_4803.15 값="Ebony_지형텍스처\겨울\4803-16.png"/>
				<_4803.16 값="Ebony_지형텍스처\겨울\4803-17.png"/>
				<_4803.17 값="Ebony_지형텍스처\겨울\4803-18.png"/>
				<_4803.18 값="Ebony_지형텍스처\겨울\4803-19.png"/>
				<_4803.19 값="Ebony_지형텍스처\겨울\4803-20.png"/>
				<_4803.20 값="Ebony_지형텍스처\겨울\4803-21.png"/>
				<_4803.21 값="Ebony_지형텍스처\겨울\4803-22.png"/>
				<_4803.22 값="Ebony_지형텍스처\겨울\4803-23.png"/>
				<_4803.23 값="Ebony_지형텍스처\겨울\4803-24.png"/>
				<_4803.24 값="Ebony_지형텍스처\겨울\4803-25.png"/>
				<_4803.25 값="Ebony_지형텍스처\겨울\4803-26.png"/>
				<_4803.26 값="Ebony_지형텍스처\겨울\4803-27.png"/>
				<_4803.27 값="Ebony_지형텍스처\겨울\4803-28.png"/>
				<_4803.28 값="Ebony_지형텍스처\겨울\4803-29.png"/>
				<_4803.29 값="Ebony_지형텍스처\겨울\4803-30.png"/>
				<_4803.30 값="Ebony_지형텍스처\겨울\4803-31.png"/>
				<_4803.31 값="Ebony_지형텍스처\겨울\4803-32.png"/>
				<_4803.32 값="Ebony_지형텍스처\겨울\4803-33.png"/>
				<_4803.33 값="Ebony_지형텍스처\겨울\4803-34.png"/>
				<_4803.34 값="Ebony_지형텍스처\겨울\4803-35.png"/>
				<_4803.35 값=""/>

			// 카메라

				<camera.fov 값="30"/>//<!-- 기본값: 30.0 -->
				<camera.near 값="10"/>//<!-- 기본값: 16.0 -->				
				<camera.far 값="1150"/>//<!-- 기본값: 1000.0 -->				
				<camera.min_x 값="0"/>//<!-- 기본값: 560.0 -->				
				<camera.max_x 값="5120"/>//<!-- 기본값: 4480.0 -->				
				<camera.max_y 값="5120"/>//<!-- 기본값: 4580.0 -->				
				<camera.min_angle 값="0"/>//<!-- 기본값: 22.5 -->				
				<camera.max_angle 값="89.9999"/>//<!-- 기본값: 55.0 -->				
				<camera.zoom_in 값="32"/>//<!-- 확대 거리(기본값: 220.0) -->				
				<camera.zoom_out0 값="580"/>//<!-- CG품질 저 축소거리(기본값: 400.0) -->				
				<camera.zoom_out1 값="680"/>//<!-- CG품질 중 축소거리(기본값: 500.0) -->				
				<camera.zoom_out2 값="780"/>//<!-- CG품질 고 축소거리(기본값: 600.0) -->				
				<camera.through 값="true"/>//<!-- 지형 통과(기본값: false) -->				
				<camera.fog 값="1.0"/>//<!-- 낮을 수록 안개가 줄어듬.(기본값: 2.55) -->				
				<camera.free 값=""/>				
				// <camera.rEberse_x 값=""/>//<!-- free 값이 true일 경우 X축 방향을 반대로(기본값: false) -->				
				// <camera.rEberse_y 값=""/>//<!-- free 값이 true일 경우 Y축 방향을 반대로(기본값: true) -->
			</pk>
			""");
		}
	}

	Main main;
}